---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RoofAttrThicknessParam
source: html/690f5d8d-b537-8a70-b502-9b271f8535eb.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RoofAttrThicknessParam Property

"Thickness"

## Syntax (C#)
```csharp
public static ForgeTypeId RoofAttrThicknessParam { get; }
```